app/views/questions/_form.html.erb

SELECT "topics"."title", "topics"."id" FROM "topics"
---
    <%= form.label :topic_ids, 'Topic', style: "display: block" %>
    <%= form.select :topic_ids, options_for_select(Topic.all.pluck(:title, :id), form.object.topic_ids), {}, multiple: true, class: 'form-control' %>