app/views/questions/show.html.erb

  <% @question.topic_ids.each do |topic| %>
    <% topic = Topic.find_by(id: topic)%>
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

      <div class="col-3">
        <% if current_user  && !current_user.topics.include?(topic) %>
---
SELECT 1 AS one FROM "topics" INNER JOIN "topics_users" ON "topics"."id" = "topics_users"."topic_id" WHERE "topics_users"."user_id" = $1 AND "topics"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 11], ["LIMIT", 1]]

          Posted By: <%= a.user.email %>
          <% if current_user != a.user && !current_user.followee.include?(a.user) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "user_following_users" ON "users"."id" = "user_following_users"."follower_id" WHERE "user_following_users"."followee_id" = $1 AND "users"."id" = $2 LIMIT $3  [["followee_id", 1], ["id", 2], ["LIMIT", 1]]