app/controllers/answers_controller.rb

INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "cdscdsc"], ["user_id", 2], ["question_id", 11], ["created_at", "2023-06-21 19:08:13.770466"], ["updated_at", "2023-06-21 19:08:13.770466"]]
---
  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save