app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."id" DESC
---
  def index
    @questions = Question.all.order(id: :desc)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "user_following_users" ON "users"."id" = "user_following_users"."followee_id" WHERE "user_following_users"."follower_id" = ? AND "users"."id" = ? LIMIT ?  [["follower_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def follow_user
    @user = User.find_by(id: params[:id])
    if !@user.followers.include?(current_user)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def follow_topic
    @topic = Topic.find_by(id: params[:id])

INSERT INTO "questions" ("title", "content", "user_id", "created_at", "updated_at", "topic_ids") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test"], ["content", "test"], ["user_id", 1], ["created_at", "2023-06-21 18:48:22.173823"], ["updated_at", "2023-06-21 18:48:22.173823"], ["topic_ids", "{1,2,3}"]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "updated_at" = $1, "topic_ids" = $2 WHERE "questions"."id" = $3  [["updated_at", "2023-06-21 18:53:51.135475"], ["topic_ids", "{12,13}"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)